{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Data URLs are not a valid image source.": "כתובות URL של נתונים אינן מקור תמונה חוקי.",
			"Embedded SVGs are not a valid image source.": "קובצי SVG מוטבעים אינם מקור תמונה חוקי.",
			"Error parsing the when-clause:": "שגיאה בניתוח סעיף ה-when:",
			"Images must use the HTTPS protocol.": "תמונות חייבות להשתמש בפרוטוקול HTTPS.",
			"Language specific editor settings": "הגדרות עורך ספציפיות לשפה",
			"Override editor settings for language": "עקוף הגדרות עורך עבור שפה",
			"Relative badge URLs require a repository with HTTPS protocol to be specified in this package.json.": "כתובות URL יחסיות של תגים דורשות ציון של מאגר עם פרוטוקול HTTPS בקובץ package.json זה.",
			"Relative image URLs require a repository with HTTPS protocol to be specified in the package.json.": "כתובות URL יחסיות של תמונות דורשות ציון של מאגר עם פרוטוקול HTTPS בקובץ package.json.",
			"Remove activation event": "הסר אירוע הפעלה",
			"SVGs are not a valid image source.": "קובצי SVG אינם מקור תמונה חוקי.",
			"This activation event can be removed as VS Code generates these automatically from your package.json contribution declarations.": "ניתן להסיר אירוע הפעלה זה מכיוון ש-VS Code יוצר אותם באופן אוטומטי מהצהרות התרומה שלך ב-package.json.",
			"This activation event can be removed for extensions targeting engine version ^1.75 as VS Code will generate these automatically from your package.json contribution declarations.": "ניתן להסיר אירוע הפעלה זה עבור הרחבות המכוונות לגרסת מנוע ^1.75 מכיוון ש-VS Code יפיק אותם באופן אוטומטי מהצהרות התרומה שלך ב-package.json.",
			"This activation event cannot be explicitly listed by your extension.": "אירוע הפעלה זה אינו יכול להיות רשום במפורש על ידי ההרחבה שלך.",
			"This proposal cannot be used because for this extension the product defines a fixed set of API proposals. You can test your extension but before publishing you MUST reach out to the VS Code team.": "לא ניתן להשתמש בהצעה זו מכיוון שעבור הרחבה זו המוצר מגדיר קבוצה קבועה של הצעות API. תוכל לבדוק את ההרחבה שלך אך לפני הפרסום עליך לפנות לצוות VS Code.",
			"Using '*' activation is usually a bad idea as it impacts performance.": "שימוש בהפעלת '*' הוא בדרך כלל רעיון רע מכיוון שהוא משפיע על הביצועים."
		},
		"package": {
			"description": "מספק יכולות ניקוי ליצירת הרחבות.",
			"displayName": "יצירת הרחבות"
		}
	}
}
