{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"\"store\" a boolean test for later evaluation in a guard or if().": "\"אחסן\" בדיקה בוליאנית להערכה מאוחרת יותר בשומר או ב-if().",
			"'from' expected": "צפוי 'from'",
			"'in' expected": "צפוי 'in'",
			"'through' or 'to' expected": "צפוי 'through' או 'to'",
			"'{0}'": "'{0}'",
			"( expected": "צפוי (",
			") expected": "צפוי )",
			"<undefined>": "<לא מוגדר>",
			"@font-face": "@font-face",
			"@font-face rule must define 'src' and 'font-family' properties": "כלל @font-face חייב להגדיר מאפייני 'src' ו-'font-family'",
			"@keyframes {0}": "@keyframes {0}",
			"A list of properties that are not validated against the `unknownProperties` rule.": "רשימה של מאפיינים שאינם מאומתים כנגד כלל `unknownProperties`.",
			"Adds quotes to a string.": "מוסיף מרכאות למחרוזת.",
			"Also define the standard property '{0}' for compatibility": "הגדר גם את המאפיין הסטנדרטי '{0}' לתאימות",
			"Always define standard rule '@keyframes' when defining keyframes.": "הגדר תמיד כלל סטנדרטי '@keyframes' בעת הגדרת keyframes.",
			"Always include all vendor specific properties: Missing: {0}": "כלול תמיד את כל המאפיינים הספציפיים לספק: חסר: {0}",
			"Always include all vendor specific rules: Missing: {0}": "כלול תמיד את כל הכללים הספציפיים לספק: חסר: {0}",
			"Appends a single value onto the end of a list.": "מצרף ערך בודד לסוף רשימה.",
			"Appends selectors to one another without spaces in between.": "מצרף בוררים זה לזה ללא רווחים ביניהם.",
			"Avoid using !important. It is an indication that the specificity of the entire CSS has gotten out of control and needs to be refactored.": "הימנע משימוש ב-!important. זהו אינדיקציה לכך שהספציפיות של כל ה-CSS יצאה מכלל שליטה ויש לבצע בה שינוי מבני.",
			"Avoid using 'float'. Floats lead to fragile CSS that is easy to break if one aspect of the layout changes.": "הימנע משימוש ב-'float'. צפים מובילים ל-CSS שביר שקל לשבור אם היבט אחד של הפריסה משתנה.",
			"CSS Language Server": "שרת שפת CSS",
			"CSS fix is outdated and can't be applied to the document.": "תיקון ה-CSS מיושן ולא ניתן להחילו על המסמך.",
			"Causes one or more rules to be emitted at the root of the document.": "גורם לפליטת כלל אחד או יותר בשורש המסמך.",
			"Changes one or more properties of a color.": "משנה מאפיין אחד או יותר של צבע.",
			"Changes the alpha component for a color.": "משנה את רכיב האלפא של צבע.",
			"Changes the hue of a color.": "משנה את גוון הצבע.",
			"Combines several lists into a single multidimensional list.": "משלב מספר רשימות לרשימה רב-ממדית אחת.",
			"Converts a color into the format understood by IE filters.": "ממיר צבע לפורמט המובן על ידי מסנני IE.",
			"Converts a color to grayscale.": "ממיר צבע לגווני אפור.",
			"Converts a string to lower case.": "ממיר מחרוזת לאותיות קטנות.",
			"Converts a string to upper case.": "ממיר מחרוזת לאותיות גדולות.",
			"Converts a unitless number to a percentage.": "ממיר מספר ללא יחידה לאחוז.",
			"Creates a Color from hue, saturation, and lightness values.": "יוצר צבע מערכי גוון, רוויה ובהירות.",
			"Creates a Color from hue, saturation, lightness, and alpha values.": "יוצר צבע מערכי גוון, רוויה, בהירות ואלפא.",
			"Creates a Color from hue, white, and black values.": "יוצר צבע מערכי גוון, לבן ושחור.",
			"Creates a Color from lightness, a, and b values.": "יוצר צבע מערכי בהירות, a ו-b.",
			"Creates a Color from lightness, chroma, and hue values.": "יוצר צבע מערכי בהירות, כרומה וגוון.",
			"Creates a Color from red, green, and blue values.": "יוצר צבע מערכי אדום, ירוק וכחול.",
			"Creates a Color from red, green, blue, and alpha values.": "יוצר צבע מערכי אדום, ירוק, כחול ואלפא.",
			"Creates a Color from the hue, saturation, and lightness values of another Color.": "יוצר צבע מערכי הגוון, הרוויה והבהירות של צבע אחר.",
			"Creates a Color from the hue, white, and black values of another Color.": "יוצר צבע מערכי הגוון, הלבן והשחור של צבע אחר.",
			"Creates a Color from the lightness, a, and b values of another Color.": "יוצר צבע מערכי הבהירות, a ו-b של צבע אחר.",
			"Creates a Color from the lightness, chroma, and hue values of another Color.": "יוצר צבע מערכי הבהירות, הכרומה והגוון של צבע אחר.",
			"Creates a Color from the red, green, and blue values of another Color.": "יוצר צבע מערכי האדום, הירוק והכחול של צבע אחר.",
			"Creates a Color in a specific color space from red, green, and blue values.": "יוצר צבע במרחב צבעים ספציפי מערכי אדום, ירוק וכחול.",
			"Creates a Color in a specific color space from the red, green, and blue values of another Color.": "יוצר צבע במרחב צבעים ספציפי מערכי האדום, הירוק והכחול של צבע אחר.",
			"Defines complex operations that can be re-used throughout stylesheets.": "מגדיר פעולות מורכבות שניתן לעשות בהן שימוש חוזר ברחבי גיליונות הסגנונות.",
			"Defines styles that can be re-used throughout the stylesheet with `@include`.": "מגדיר סגנונות שניתן לעשות בהם שימוש חוזר ברחבי גיליון הסגנונות עם `@include`.",
			"Do not use duplicate style definitions": "אל תשתמש בהגדרות סגנון כפולות",
			"Do not use empty rulesets": "אל תשתמש בערכות כללים ריקות",
			"Do not use width or height when using padding or border": "אל תשתמש ברוחב או גובה בעת שימוש בריפוד או גבול",
			"Dynamically calls a Sass function.": "קורא באופן דינמי לפונקציית Sass.",
			"Each loop that sets `$var` to each item in the list or map, then outputs the styles it contains using that value of `$var`.": "כל לולאה שמגדירה את `$var` לכל פריט ברשימה או במפה, ואז מוציאה את הסגנונות שהיא מכילה באמצעות אותו ערך של `$var`.",
			"Exposes the details of Sass’s inner workings.": "חושף את פרטי הפעולה הפנימית של Sass.",
			"Extends $extendee with $extender within $selector.": "מרחיב את $extendee עם $extender בתוך $selector.",
			"Extracts a substring from $string.": "מחלץ מחרוזת משנה מ-$string.",
			"Failed to apply CSS fix to the document. Please consider opening an issue with steps to reproduce.": "נכשל בהחלת תיקון ה-CSS על המסמך. אנא שקול לפתוח בעיה עם שלבים לשחזור.",
			"Finds the maximum of several numbers.": "מוצא את המקסימום של מספר מספרים.",
			"Finds the minimum of several numbers.": "מוצא את המינימום של מספר מספרים.",
			"Fluidly scales one or more properties of a color.": "משנה באופן דינמי מאפיין אחד או יותר של צבע.",
			"Folding Region End": "סוף אזור קיפול",
			"Folding Region Start": "תחילת אזור קיפול",
			"For loop that repeatedly outputs a set of styles for each `$var` in the `from/through` or `from/to` clause.": "לולאת For שמוציאה שוב ושוב קבוצה של סגנונות עבור כל `$var` בסעיף `from/through` או `from/to`.",
			"Generates new colors based on existing ones, making it easy to build color themes.": "יוצר צבעים חדשים על בסיס צבעים קיימים, מה שמקל על בניית ערכות נושא של צבעים.",
			"Gets the blue component of a color.": "מקבל את הרכיב הכחול של צבע.",
			"Gets the green component of a color.": "מקבל את הרכיב הירוק של צבע.",
			"Gets the hue component of a color.": "מקבל את רכיב הגוון של צבע.",
			"Gets the lightness component of a color.": "מקבל את רכיב הבהירות של צבע.",
			"Gets the opacity component of a color.": "מקבל את רכיב האטימות של צבע.",
			"Gets the red component of a color.": "מקבל את הרכיב האדום של צבע.",
			"Gets the saturation component of a color.": "מקבל את רכיב הרוויה של צבע.",
			"Hex colors must consist of three, four, six or eight hex numbers": "צבעים הקסדצימליים חייבים להיות מורכבים משלושה, ארבעה, שישה או שמונה מספרים הקסדצימליים",
			"IE hacks are only necessary when supporting IE7 and older": "פריצות IE נחוצות רק בעת תמיכה ב-IE7 ומטה",
			"Import statements do not load in parallel": "הצהרות ייבוא אינן נטענות במקביל",
			"Includes the body if the expression does not evaluate to `false` or `null`.": "כולל את הגוף אם הביטוי אינו מוערך ל-`false` או `null`.",
			"Includes the styles defined by another mixin into the current rule.": "כולל את הסגנונות שהוגדרו על ידי mixin אחר לתוך הכלל הנוכחי.",
			"Increases or decreases one or more components of a color.": "מגדיל או מקטין רכיב אחד או יותר של צבע.",
			"Inherits the styles of another selector.": "יורש את הסגנונות של בורר אחר.",
			"Insert url() Function": "הכנס פונקציית url()",
			"Insert url() Functions": "הכנס פונקציות url()",
			"Inserts $insert into $string at $index.": "מכניס את $insert לתוך $string ב-$index.",
			"Invalid number of parameters": "מספר פרמטרים לא חוקי",
			"Joins together two lists into one.": "מאחד שתי רשימות לאחת.",
			"Lets you access and modify values in lists.": "מאפשר לך לגשת ולשנות ערכים ברשימות.",
			"Loads a Sass stylesheet and makes its mixins, functions, and variables available when this stylesheet is loaded with the @use rule.": "טוען גיליון סגנונות של Sass והופך את ה-mixins, הפונקציות והמשתנים שלו לזמינים כאשר גיליון סגנונות זה נטען עם כלל @use.",
			"Loads mixins, functions, and variables from other Sass stylesheets as 'modules', and combines CSS from multiple stylesheets together.": "טוען mixins, פונקציות ומשתנים מגיליונות סגנונות אחרים של Sass כ'מודולים', ומשלב CSS מגיליונות סגנונות מרובים יחד.",
			"Makes a color darker.": "הופך צבע לכהה יותר.",
			"Makes a color less saturated.": "הופך צבע לפחות רווי.",
			"Makes a color lighter.": "הופך צבע לבהיר יותר.",
			"Makes a color more opaque.": "הופך צבע לאטום יותר.",
			"Makes a color more saturated.": "הופך צבע לרווי יותר.",
			"Makes a color more transparent.": "הופך צבע לשקוף יותר.",
			"Makes it easy to combine, search, or split apart strings.": "מקל על שילוב, חיפוש או פיצול מחרוזות.",
			"Makes it possible to look up the value associated with a key in a map, and much more.": "מאפשר לחפש את הערך המשויך למפתח במפה, ועוד הרבה יותר.",
			"Merges two maps together into a new map.": "ממזג שתי מפות יחד למפה חדשה.",
			"Mix two colors together in a polar color space.": "ערבב שני צבעים יחד במרחב צבעים קוטבי.",
			"Mix two colors together in a rectangular color space.": "ערבב שני צבעים יחד במרחב צבעים מלבני.",
			"Mixes two colors together.": "מערבב שני צבעים יחד.",
			"Nests selector beneath one another like they would be nested in the stylesheet.": "ממקם בוררים זה מתחת לזה כאילו היו מקוננים בגיליון הסגנונות.",
			"No unit for zero needed": "אין צורך ביחידה עבור אפס",
			"Parses a selector into the format returned by &.": "מנתח בורר לפורמט המוחזר על ידי &.",
			"Prints the value of an expression to the standard error output stream. Useful for debugging complicated Sass files.": "מדפיס את ערך הביטוי לזרם הפלט של השגיאה הסטנדרטית. שימושי לניפוי באגים בקבצי Sass מסובכים.",
			"Prints the value of an expression to the standard error output stream. Useful for libraries that need to warn users of deprecations or recovering from minor mixin usage mistakes. Warnings can be turned off with the `--quiet` command-line option or the `:quiet` Sass option.": "מדפיס את ערך הביטוי לזרם הפלט של השגיאה הסטנדרטית. שימושי לספריות שצריכות להזהיר משתמשים מפני הוצאה משימוש או התאוששות מטעויות שימוש קטנות ב-mixin. ניתן לכבות אזהרות באמצעות אפשרות שורת הפקודה `--quiet` או אפשרות Sass `:quiet`.",
			"Property is ignored due to the display.": "המאפיין מתעלם ממנו עקב התצוגה.",
			"Property is ignored due to the display. With 'display: block', vertical-align should not be used.": "המאפיין מתעלם ממנו עקב התצוגה. עם 'display: block', אין להשתמש ב-vertical-align.",
			"Provides access to Sass’s powerful selector engine.": "מספק גישה למנוע הבוררים החזק של Sass.",
			"Provides functions that operate on numbers.": "מספק פונקציות הפועלות על מספרים.",
			"Removes quotes from a string.": "מסיר מרכאות ממחרוזת.",
			"Rename to '{0}'": "שנה שם ל-'{0}'",
			"Replaces $original with $replacement within $selector.": "מחליף את $original ב-$replacement בתוך $selector.",
			"Replaces the nth item in a list.": "מחליף את הפריט ה-n ברשימה.",
			"Returns a list of all keys in a map.": "מחזיר רשימה של כל המפתחות במפה.",
			"Returns a list of all values in a map.": "מחזיר רשימה של כל הערכים במפה.",
			"Returns a new map with keys removed.": "מחזיר מפה חדשה עם מפתחות שהוסרו.",
			"Returns a random number.": "מחזיר מספר אקראי.",
			"Returns a specific item in a list.": "מחזיר פריט ספציפי ברשימה.",
			"Returns the absolute value of a number.": "מחזיר את הערך המוחלט של מספר.",
			"Returns the complement of a color.": "מחזיר את המשלים של צבע.",
			"Returns the index of the first occurance of $substring in $string.": "מחזיר את האינדקס של המופע הראשון של $substring ב-$string.",
			"Returns the inverse of a color.": "מחזיר את ההיפוך של צבע.",
			"Returns the keywords passed to a function that takes variable arguments.": "מחזיר את מילות המפתח שהועברו לפונקציה המקבלת ארגומנטים משתנים.",
			"Returns the length of a list.": "מחזיר את אורך הרשימה.",
			"Returns the number of characters in a string.": "מחזיר את מספר התווים במחרוזת.",
			"Returns the position of a value within a list.": "מחזיר את מיקום הערך בתוך רשימה.",
			"Returns the separator of a list.": "מחזיר את המפריד של רשימה.",
			"Returns the simple selectors that comprise a compound selector.": "מחזיר את הבוררים הפשוטים המרכיבים בורר מורכב.",
			"Returns the string representation of a value as it would be represented in Sass.": "מחזיר את ייצוג המחרוזת של ערך כפי שהוא יוצג ב-Sass.",
			"Returns the type of a value.": "מחזיר את סוג הערך.",
			"Returns the unit(s) associated with a number.": "מחזיר את היחידה/ות המשויכת/ות למספר.",
			"Returns the value in a map associated with a given key.": "מחזיר את הערך במפה המשויך למפתח נתון.",
			"Returns whether $super matches all the elements $sub does, and possibly more.": "מחזיר אם $super תואם לכל האלמנטים ש-$sub תואם, ואולי יותר.",
			"Returns whether a feature exists in the current Sass runtime.": "מחזיר אם תכונה קיימת בזמן הריצה הנוכחי של Sass.",
			"Returns whether a function with the given name exists.": "מחזיר אם קיימת פונקציה עם השם הנתון.",
			"Returns whether a map has a value associated with a given key.": "מחזיר אם למפה יש ערך המשויך למפתח נתון.",
			"Returns whether a mixin with the given name exists.": "מחזיר אם קיים mixin עם השם הנתון.",
			"Returns whether a number has units.": "מחזיר אם למספר יש יחידות.",
			"Returns whether a variable with the given name exists in the current scope.": "מחזיר אם קיים משתנה עם השם הנתון בהיקף הנוכחי.",
			"Returns whether a variable with the given name exists in the global scope.": "מחזיר אם קיים משתנה עם השם הנתון בהיקף הגלובלי.",
			"Returns whether two numbers can be added, subtracted, or compared.": "מחזיר אם ניתן להוסיף, לחסר או להשוות שני מספרים.",
			"Rounds a number down to the previous whole number.": "מעגל מספר כלפי מטה למספר השלם הקודם.",
			"Rounds a number to the nearest whole number.": "מעגל מספר למספר השלם הקרוב ביותר.",
			"Rounds a number up to the next whole number.": "מעגל מספר כלפי מעלה למספר השלם הבא.",
			"Sass documentation": "תיעוד Sass",
			"Selector Specificity": "ספציפיות בורר",
			"Selectors should not contain IDs because these rules are too tightly coupled with the HTML.": "בוררים לא צריכים להכיל מזהים מכיוון שכללים אלה קשורים מדי ל-HTML.",
			"The universal selector (*) is known to be slow": "הבורר האוניברסלי (*) ידוע כאיטי",
			"Throws the value of an expression as a fatal error with stack trace. Useful for validating arguments to mixins and functions.": "זורק את ערך הביטוי כשגיאה קטלנית עם עקבות מחסנית. שימושי לאימות ארגומנטים ל-mixins ופונקציות.",
			"URI expected": "צפוי URI",
			"URL encodes a string": "מקודד כתובת URL למחרוזת",
			"Unifies two selectors to produce a selector that matches elements matched by both.": "מאחד שני בוררים כדי ליצור בורר התואם לאלמנטים התואמים לשניהם.",
			"Unknown at-rule.": "כלל at לא ידוע.",
			"Unknown property.": "מאפיין לא ידוע.",
			"Unknown property: '{0}'": "מאפיין לא ידוע: '{0}'",
			"Unknown vendor specific property.": "מאפיין ספציפי לספק לא ידוע.",
			"When using a vendor-specific prefix also include the standard property": "בעת שימוש בקידומת ספציפית לספק, כלול גם את המאפיין הסטנדרטי",
			"When using a vendor-specific prefix make sure to also include all other vendor-specific properties": "בעת שימוש בקידומת ספציפית לספק, ודא שאתה כולל גם את כל שאר המאפיינים הספציפיים לספק",
			"While loop that takes an expression and repeatedly outputs the nested styles until the statement evaluates to `false`.": "לולאת While המקבלת ביטוי ומוציאה שוב ושוב את הסגנונות המקוננים עד שההצהרה מוערכת ל-`false`.",
			"[ expected": "צפוי [",
			"] expected": "צפוי ]",
			"absolute value of a number": "ערך מוחלט של מספר",
			"arccosine - inverse of cosine function": "ארקוסינוס - פונקציה הפוכה של פונקציית הקוסינוס",
			"arcsine - inverse of sine function": "ארקסינוס - פונקציה הפוכה של פונקציית הסינוס",
			"arctangent - inverse of tangent function": "ארקטנגנס - פונקציה הפוכה של פונקציית הטנגנס",
			"argument from '{0}'": "ארגומנט מ-'{0}'",
			"at-rule or selector expected": "צפוי כלל at או בורר",
			"at-rule unknown": "כלל at לא ידוע",
			"bind the evaluation of a ruleset to each member of a list.": "קשור את הערכת ערכת הכללים לכל חבר ברשימה.",
			"calculates square root of a number": "מחשב שורש ריבועי של מספר",
			"colon expected": "צפויה נקודתיים",
			"comma expected": "צפוי פסיק",
			"condition expected": "צפוי תנאי",
			"converts numbers from one type into another": "ממיר מספרים מסוג אחד לאחר.",
			"converts to a %, e.g. 0.5 > 50%": "ממיר ל-%, לדוגמה 0.5 > 50%",
			"cosine function": "פונקציית קוסינוס",
			"creates a #AARRGGBB": "יוצר #AARRGGBB",
			"creates a color": "יוצר צבע",
			"css.builtin.lab": "css.builtin.lab",
			"dot expected": "צפויה נקודה",
			"escape string content": "תוכן מחרוזת בריחה",
			"expression expected": "צפוי ביטוי",
			"first argument modulus second argument": "ארגומנט ראשון מודולו ארגומנט שני",
			"first argument raised to the power of the second argument": "ארגומנט ראשון בחזקת הארגומנט השני",
			"generate a list spanning a range of values": "צור רשימה המשתרעת על פני טווח ערכים",
			"identifier expected": "צפוי מזהה",
			"identifier or variable expected": "צפוי מזהה או משתנה",
			"identifier or wildcard expected": "צפוי מזהה או תו כללי",
			"inline-block is ignored due to the float. If 'float' has a value other than 'none', the box is floated and 'display' is treated as 'block'": "inline-block מתעלם ממנו עקב ה-float. אם ל-'float' יש ערך שאינו 'none', התיבה צפה ו-'display' מטופל כ-'block'",
			"inlines a resource and falls back to `url()`": "מטמיע משאב וחוזר ל-`url()`",
			"media query expected": "צפויה שאילתת מדיה",
			"number expected": "צפוי מספר",
			"operator expected": "צפוי אופרטור",
			"page directive or declaraton expected": "צפויה הנחיית עמוד או הצהרה",
			"parses a string to a color": "מנתח מחרוזת לצבע.",
			"percentage expected": "צפוי אחוז",
			"property value expected": "צפוי ערך מאפיין",
			"remove or change the unit of a dimension": "הסר או שנה את יחידת הממד",
			"return `@color` 10% points darker": "החזר `@color` 10% נקודות כהה יותר",
			"return `@color` 10% points less saturated": "החזר `@color` 10% נקודות פחות רווי",
			"return `@color` 10% points less transparent": "החזר `@color` 10% נקודות פחות שקוף",
			"return `@color` 10% points lighter": "החזר `@color` 10% נקודות בהיר יותר",
			"return `@color` 10% points more saturated": "החזר `@color` 10% נקודות יותר רווי",
			"return `@color` 10% points more transparent": "החזר `@color` 10% נקודות יותר שקוף",
			"return `@color` with 50% transparency": "החזר `@color` עם 50% שקיפות",
			"return `@color` with a 10 degree larger in hue": "החזר `@color` עם גוון גדול יותר ב-10 מעלות",
			"return `@darkcolor` if `@color1 is> 43% luma` otherwise return `@lightcolor`, see notes": "החזר `@darkcolor` אם `@color1 is> 43% luma` אחרת החזר `@lightcolor`, ראה הערות",
			"return a mix of `@color1` and `@color2`": "החזר תערובת של `@color1` ו-`@color2`",
			"returns a grey, 100% desaturated color": "מחזיר צבע אפור, 100% לא רווי",
			"returns a value at the specified position in the list": "מחזיר ערך במיקום שצוין ברשימה.",
			"returns one of two values depending on a condition.": "מחזיר אחד משני ערכים בהתאם לתנאי.",
			"returns pi": "מחזיר פאי.",
			"returns the `alpha` channel of `@color`": "מחזיר את ערוץ ה-`alpha` של `@color`",
			"returns the `blue` channel of `@color`": "מחזיר את ערוץ ה-`blue` של `@color`",
			"returns the `green` channel of `@color`": "מחזיר את ערוץ ה-`green` של `@color`",
			"returns the `hue` channel of `@color` in the HSL space": "מחזיר את ערוץ ה-`hue` של `@color` במרחב HSL",
			"returns the `hue` channel of `@color` in the HSV space": "מחזיר את ערוץ הגוון של `@color` במרחב HSV.",
			"returns the `lightness` channel of `@color` in the HSL space": "מחזיר את ערוץ ה-`lightness` של `@color` במרחב HSL",
			"returns the `luma` value (perceptual brightness) of `@color`": "מחזיר את ערך ה-`luma` (בהירות נתפסת) של `@color`",
			"returns the `red` channel of `@color`": "מחזיר את ערוץ ה-`red` של `@color`",
			"returns the `saturation` channel of `@color` in the HSL space": "מחזיר את ערוץ ה-`saturation` של `@color` במרחב HSL.",
			"returns the `saturation` channel of `@color` in the HSV space": "מחזיר את ערוץ הרוויה של `@color` במרחב HSV.",
			"returns the `value` channel of `@color` in the HSV space": "מחזיר את ערוץ הערך של `@color` במרחב HSV.",
			"returns the lowest of one or more values": "מחזיר את הנמוך מבין ערך אחד או יותר.",
			"returns the number of elements in a value list": "מחזיר את מספר האלמנטים ברשימת ערכים.",
			"rounds a number to a number of places": "מעגל מספר למספר מקומות",
			"rounds down to an integer": "מעגל כלפי מטה למספר שלם",
			"rounds up to an integer": "מעגל כלפי מעלה למספר שלם",
			"selector expected": "צפוי בורר",
			"semi-colon expected": "צפוי נקודה-פסיק",
			"sine function": "פונקציית סינוס",
			"string literal expected": "צפוי ליטרל מחרוזת",
			"string replace": "החלפת מחרוזת",
			"tangent function": "פונקציית טנגנס",
			"term expected": "צפוי מונח",
			"unknown keyword": "מילת מפתח לא ידועה",
			"uri or string expected": "צפוי URI או מחרוזת",
			"variable name expected": "צפוי שם משתנה",
			"variable value expected": "צפוי ערך משתנה",
			"whitespace expected": "צפוי רווח לבן",
			"wildcard expected": "צפוי תו כללי",
			"{ expected": "צפוי {",
			"{0}, '{1}'": "{0}, '{1}'",
			"} expected": "צפוי }"
		},
		"package": {
			"css.colorDecorators.enable.deprecationMessage": "ההגדרה 'css.colorDecorators.enable' הוצאה משימוש והוחלפה ב-'editor.colorDecorators'.",
			"css.completion.completePropertyWithSemicolon.desc": "הוסף נקודה-פסיק בסוף השורה בעת השלמת מאפיין CSS.",
			"css.completion.triggerPropertyValueCompletion.desc": "כברירת מחדל, VS Code מפעיל השלמת ערך מאפיין לאחר בחירת מאפיין CSS. השתמש בהגדרה זו כדי להשבית התנהגות זו.",
			"css.customData.desc": "רשימה של נתיבי קבצים יחסיים המצביעים על קבצי JSON ב[פורמט נתונים מותאם אישית](https://github.com/microsoft/vscode-css-languageservice/blob/master/docs/customData.md).\r\n\r\nVS Code טוען נתונים מותאמים אישית בעת ההפעלה כדי לשפר את תמיכת ה-CSS עבור מאפייני CSS מותאמים אישית (משתנים), כללי at, פסאודו-מחלקות ופסאודו-אלמנטים שאתה מציין בקבצי ה-JSON.\r\n\r\nנתיבי הקבצים הם יחסיים לסביבת העבודה ורק הגדרות תיקיית סביבת העבודה נחשבות.",
			"css.format.braceStyle.desc": "שים סוגריים מסולסלים באותה שורה כמו כללים (`collapse`) או סוגריים מסולסלים בשורה משלהם (`expand`).",
			"css.format.enable.desc": "אפשר/השבת את מעצב ה-CSS המוגדר כברירת מחדל.",
			"css.format.maxPreserveNewLines.desc": "המספר המרבי של מעברי שורה שיש לשמור בבלוק אחד כאשר `#css.format.preserveNewLines#` מופעל.",
			"css.format.newlineBetweenRules.desc": "הפרד ערכות כללים בשורה ריקה.",
			"css.format.newlineBetweenSelectors.desc": "הפרד בוררים בשורה חדשה.",
			"css.format.preserveNewLines.desc": "שולט אם לשמור על מעברי שורה קיימים לפני כללים והצהרות.",
			"css.format.spaceAroundSelectorSeparator.desc": "ודא שיש רווח סביב מפרידי הבוררים '>', '+', '~' (לדוגמה, 'a > b').",
			"css.hover.documentation": "הצג תיעוד מאפיינים וערכים בריחוף CSS.",
			"css.hover.references": "הצג הפניות ל-MDN בריחוף CSS.",
			"css.lint.argumentsInColorFunction.desc": "מספר פרמטרים לא חוקי.",
			"css.lint.boxModel.desc": "אל תשתמש ב-'width' או 'height' בעת שימוש ב-'padding' או 'border'.",
			"css.lint.compatibleVendorPrefixes.desc": "בעת שימוש בקידומת ספציפית לספק, ודא שאתה כולל גם את כל שאר המאפיינים הספציפיים לספק.",
			"css.lint.duplicateProperties.desc": "אל תשתמש בהגדרות סגנון כפולות.",
			"css.lint.emptyRules.desc": "אל תשתמש בערכות כללים ריקות.",
			"css.lint.float.desc": "הימנע משימוש ב-'float'. צפים מובילים ל-CSS שביר שקל לשבור אם היבט אחד של הפריסה משתנה.",
			"css.lint.fontFaceProperties.desc": "כלל `@font-face` חייב להגדיר מאפייני `src` ו-`font-family`.",
			"css.lint.hexColorLength.desc": "צבעים הקסדצימליים חייבים להיות מורכבים מ-3, 4, 6 או 8 מספרים הקסדצימליים.",
			"css.lint.idSelector.desc": "בוררים לא צריכים להכיל מזהים מכיוון שכללים אלה קשורים מדי ל-HTML.",
			"css.lint.ieHack.desc": "פריצות IE נחוצות רק בעת תמיכה ב-IE7 ומטה.",
			"css.lint.importStatement.desc": "הצהרות ייבוא אינן נטענות במקביל.",
			"css.lint.important.desc": "הימנע משימוש ב-'!important'. זהו אינדיקציה לכך שהספציפיות של כל ה-CSS יצאה מכלל שליטה ויש לבצע בה שינוי מבני.",
			"css.lint.propertyIgnoredDueToDisplay.desc": "המאפיין מתעלם ממנו עקב התצוגה. לדוגמה, עם 'display: inline', למאפיינים 'width', 'height', 'margin-top', 'margin-bottom' ו-'float' אין השפעה.",
			"css.lint.universalSelector.desc": "הבורר האוניברסלי (*) ידוע כאיטי.",
			"css.lint.unknownAtRules.desc": "כלל at לא ידוע.",
			"css.lint.unknownProperties.desc": "מאפיין לא ידוע.",
			"css.lint.unknownVendorSpecificProperties.desc": "מאפיין ספציפי לספק לא ידוע.",
			"css.lint.validProperties.desc": "רשימה של מאפיינים שאינם מאומתים כנגד כלל 'unknownProperties'.",
			"css.lint.vendorPrefix.desc": "בעת שימוש בקידומת ספציפית לספק, כלול גם את המאפיין הסטנדרטי.",
			"css.lint.zeroUnits.desc": "אין צורך ביחידה עבור אפס.",
			"css.title": "CSS",
			"css.trace.server.desc": "עקוב אחר התקשורת בין VS Code לשרת שפת ה-CSS.",
			"css.validate.desc": "מאפשר או משבית את כל האימותים.",
			"css.validate.title": "שולט באימות CSS ובחומרת הבעיות.",
			"description": "מספק תמיכת שפה עשירה עבור קבצי CSS, LESS ו-SCSS.",
			"displayName": "תכונות שפת CSS",
			"less.colorDecorators.enable.deprecationMessage": "ההגדרה 'less.colorDecorators.enable' הוצאה משימוש והוחלפה ב-'editor.colorDecorators'.",
			"less.completion.completePropertyWithSemicolon.desc": "הוסף נקודה-פסיק בסוף השורה בעת השלמת מאפיין CSS.",
			"less.completion.triggerPropertyValueCompletion.desc": "כברירת מחדל, VS Code מפעיל השלמת ערך מאפיין לאחר בחירת מאפיין CSS. השתמש בהגדרה זו כדי להשבית התנהגות זו.",
			"less.format.braceStyle.desc": "שים סוגריים מסולסלים באותה שורה כמו כללים (`collapse`) או סוגריים מסולסלים בשורה משלהם (`expand`).",
			"less.format.enable.desc": "אפשר/השבת את מעצב ה-LESS המוגדר כברירת מחדל.",
			"less.format.maxPreserveNewLines.desc": "המספר המרבי של מעברי שורה שיש לשמור בבלוק אחד כאשר `#less.format.preserveNewLines#` מופעל.",
			"less.format.newlineBetweenRules.desc": "הפרד ערכות כללים בשורה ריקה.",
			"less.format.newlineBetweenSelectors.desc": "הפרד בוררים בשורה חדשה.",
			"less.format.preserveNewLines.desc": "שולט אם לשמור על מעברי שורה קיימים לפני כללים והצהרות.",
			"less.format.spaceAroundSelectorSeparator.desc": "ודא שיש רווח סביב מפרידי הבוררים '>', '+', '~' (לדוגמה, 'a > b').",
			"less.hover.documentation": "הצג תיעוד מאפיינים וערכים בריחוף LESS.",
			"less.hover.references": "הצג הפניות ל-MDN בריחוף LESS.",
			"less.lint.argumentsInColorFunction.desc": "מספר פרמטרים לא חוקי.",
			"less.lint.boxModel.desc": "אל תשתמש ב-'width' או 'height' בעת שימוש ב-'padding' או 'border'.",
			"less.lint.compatibleVendorPrefixes.desc": "בעת שימוש בקידומת ספציפית לספק, ודא שאתה כולל גם את כל שאר המאפיינים הספציפיים לספק.",
			"less.lint.duplicateProperties.desc": "אל תשתמש בהגדרות סגנון כפולות.",
			"less.lint.emptyRules.desc": "אל תשתמש בערכות כללים ריקות.",
			"less.lint.float.desc": "הימנע משימוש ב-'float'. צפים מובילים ל-CSS שביר שקל לשבור אם היבט אחד של הפריסה משתנה.",
			"less.lint.fontFaceProperties.desc": "כלל `@font-face` חייב להגדיר מאפייני `src` ו-`font-family`.",
			"less.lint.hexColorLength.desc": "צבעים הקסדצימליים חייבים להיות מורכבים מ-3, 4, 6 או 8 מספרים הקסדצימליים.",
			"less.lint.idSelector.desc": "בוררים לא צריכים להכיל מזהים מכיוון שכללים אלה קשורים מדי ל-HTML.",
			"less.lint.ieHack.desc": "פריצות IE נחוצות רק בעת תמיכה ב-IE7 ומטה.",
			"less.lint.importStatement.desc": "הצהרות ייבוא אינן נטענות במקביל.",
			"less.lint.important.desc": "הימנע משימוש ב-'!important'. זהו אינדיקציה לכך שהספציפיות של כל ה-CSS יצאה מכלל שליטה ויש לבצע בה שינוי מבני.",
			"less.lint.propertyIgnoredDueToDisplay.desc": "המאפיין מתעלם ממנו עקב התצוגה. לדוגמה, עם 'display: inline', למאפיינים 'width', 'height', 'margin-top', 'margin-bottom' ו-'float' אין השפעה.",
			"less.lint.universalSelector.desc": "הבורר האוניברסלי (*) ידוע כאיטי.",
			"less.lint.unknownAtRules.desc": "כלל at לא ידוע.",
			"less.lint.unknownProperties.desc": "מאפיין לא ידוע.",
			"less.lint.unknownVendorSpecificProperties.desc": "מאפיין ספציפי לספק לא ידוע.",
			"less.lint.validProperties.desc": "רשימה של מאפיינים שאינם מאומתים כנגד כלל 'unknownProperties'.",
			"less.lint.vendorPrefix.desc": "בעת שימוש בקידומת ספציפית לספק, כלול גם את המאפיין הסטנדרטי.",
			"less.lint.zeroUnits.desc": "אין צורך ביחידה עבור אפס.",
			"less.title": "LESS",
			"less.validate.desc": "מאפשר או משבית את כל האימותים.",
			"less.validate.title": "שולט באימות LESS ובחומרת הבעיות.",
			"scss.colorDecorators.enable.deprecationMessage": "ההגדרה 'scss.colorDecorators.enable' הוצאה משימוש והוחלפה ב-'editor.colorDecorators'.",
			"scss.completion.completePropertyWithSemicolon.desc": "הוסף נקודה-פסיק בסוף השורה בעת השלמת מאפיין CSS.",
			"scss.completion.triggerPropertyValueCompletion.desc": "כברירת מחדל, VS Code מפעיל השלמת ערך מאפיין לאחר בחירת מאפיין CSS. השתמש בהגדרה זו כדי להשבית התנהגות זו.",
			"scss.format.braceStyle.desc": "שים סוגריים מסולסלים באותה שורה כמו כללים (`collapse`) או סוגריים מסולסלים בשורה משלהם (`expand`).",
			"scss.format.enable.desc": "אפשר/השבת את מעצב ה-SCSS המוגדר כברירת מחדל.",
			"scss.format.maxPreserveNewLines.desc": "המספר המרבי של מעברי שורה שיש לשמור בבלוק אחד כאשר `#scss.format.preserveNewLines#` מופעל.",
			"scss.format.newlineBetweenRules.desc": "הפרד ערכות כללים בשורה ריקה.",
			"scss.format.newlineBetweenSelectors.desc": "הפרד בוררים בשורה חדשה.",
			"scss.format.preserveNewLines.desc": "שולט אם לשמור על מעברי שורה קיימים לפני כללים והצהרות.",
			"scss.format.spaceAroundSelectorSeparator.desc": "ודא שיש רווח סביב מפרידי הבוררים '>', '+', '~' (לדוגמה, 'a > b').",
			"scss.hover.documentation": "הצג תיעוד מאפיינים וערכים בריחוף SCSS.",
			"scss.hover.references": "הצג הפניות ל-MDN בריחוף SCSS.",
			"scss.lint.argumentsInColorFunction.desc": "מספר פרמטרים לא חוקי.",
			"scss.lint.boxModel.desc": "אל תשתמש ב-'width' או 'height' בעת שימוש ב-'padding' או 'border'.",
			"scss.lint.compatibleVendorPrefixes.desc": "בעת שימוש בקידומת ספציפית לספק, ודא שאתה כולל גם את כל שאר המאפיינים הספציפיים לספק.",
			"scss.lint.duplicateProperties.desc": "אל תשתמש בהגדרות סגנון כפולות.",
			"scss.lint.emptyRules.desc": "אל תשתמש בערכות כללים ריקות.",
			"scss.lint.float.desc": "הימנע משימוש ב-'float'. צפים מובילים ל-CSS שביר שקל לשבור אם היבט אחד של הפריסה משתנה.",
			"scss.lint.fontFaceProperties.desc": "כלל `@font-face` חייב להגדיר מאפייני `src` ו-`font-family`.",
			"scss.lint.hexColorLength.desc": "צבעים הקסדצימליים חייבים להיות מורכבים מ-3, 4, 6 או 8 מספרים הקסדצימליים.",
			"scss.lint.idSelector.desc": "בוררים לא צריכים להכיל מזהים מכיוון שכללים אלה קשורים מדי ל-HTML.",
			"scss.lint.ieHack.desc": "פריצות IE נחוצות רק בעת תמיכה ב-IE7 ומטה.",
			"scss.lint.importStatement.desc": "הצהרות ייבוא אינן נטענות במקביל.",
			"scss.lint.important.desc": "הימנע משימוש ב-'!important'. זהו אינדיקציה לכך שהספציפיות של כל ה-CSS יצאה מכלל שליטה ויש לבצע בה שינוי מבני.",
			"scss.lint.propertyIgnoredDueToDisplay.desc": "המאפיין מתעלם ממנו עקב התצוגה. לדוגמה, עם 'display: inline', למאפיינים 'width', 'height', 'margin-top', 'margin-bottom' ו-'float' אין השפעה.",
			"scss.lint.universalSelector.desc": "הבורר האוניברסלי (*) ידוע כאיטי.",
			"scss.lint.unknownAtRules.desc": "כלל at לא ידוע.",
			"scss.lint.unknownProperties.desc": "מאפיין לא ידוע.",
			"scss.lint.unknownVendorSpecificProperties.desc": "מאפיין ספציפי לספק לא ידוע.",
			"scss.lint.validProperties.desc": "רשימה של מאפיינים שאינם מאומתים כנגד כלל 'unknownProperties'.",
			"scss.lint.vendorPrefix.desc": "בעת שימוש בקידומת ספציפית לספק, כלול גם את המאפיין הסטנדרטי.",
			"scss.lint.zeroUnits.desc": "אין צורך ביחידה עבור אפס.",
			"scss.title": "SCSS (SASS)",
			"scss.validate.desc": "מאפשר או משבית את כל האימותים.",
			"scss.validate.title": "שולט באימות SCSS ובחומרת הבעיות."
		}
	}
}